app/controllers/current_projects_controller.rb

SELECT * FROM "current_projects"
---
  def index
    @current_projects = CurrentProject.all

SELECT * FROM "current_projects" WHERE ("current_projects"."id" = 0)
---
  def show
    @current_project = CurrentProject.find(params[:id])

SELECT * FROM "current_projects" WHERE ("current_projects"."id" = 1)
---
  def edit
    @current_project = CurrentProject.find(params[:id])

INSERT INTO "current_projects" ("project_url", "created_at", "updated_at", "pourcentage_achieved", "name_project", "description_project") VALUES(NULL, '2011-11-07 16:21:36', '2011-11-07 16:21:36', NULL, 'Benevolus', 'https://github.com/jrm2k6/Benevolus')
---
  def create
    @current_project = CurrentProject.new(params[:current_project])

    respond_to do |format|
      if @current_project.save