app/controllers/formations_controller.rb

SELECT * FROM "formations"
---
  def index
    @formations = Formation.all

SELECT * FROM "formations" WHERE ("formations"."id" = 1)
---
  def show
    @formation = Formation.find(params[:id])

SELECT * FROM "formations" WHERE ("formations"."id" = 1)
---
  def edit
    @formation = Formation.find(params[:id])

INSERT INTO "formations" ("school", "city", "begin", "created_at", "country", "degree", "updated_at", "logo", "major", "end", "website") VALUES('South Brittany University', 'Vannes', 2006, '2011-09-20 21:48:02', 'France', 'Licence informatique (equivalent to Bachelor''s degree)', '2011-09-20 21:48:02', '', 'Computer Science', 2009, 'www.univ-ubs.fr')
---
  def create
    @formation = Formation.new(params[:formation])

    respond_to do |format|
      if @formation.save

SELECT * FROM "formations" WHERE ("formations"."id" = 2)
UPDATE "formations" SET "updated_at" = '2011-10-17 15:37:40', "degree" = 'Engineering diploma (equivalent to a Master''s degree) <br\> Graduation expected in October 2012' WHERE "id" = 2
---
  def update
    @formation = Formation.find(params[:id])

    respond_to do |format|
      if @formation.update_attributes(params[:formation])

SELECT * FROM "formations" WHERE ("formations"."id" = 4)
DELETE FROM "formations" WHERE "id" = 4
---
  def destroy
    @formation = Formation.find(params[:id])
    @formation.destroy