app/controllers/presentation_controller.rb

SELECT * FROM "current_projects" WHERE ("current_projects"."id" = 2)
---
def index
	@running_projects  = CurrentProject.find(:all, :conditions => "description_project != ''")